## Sports Data Analysis

Objective : Understand the international football data

In [1]:
import os
from password import kaggle_key
os.environ['KAGGLE_USERNAME'] = 'dapinderkaurgill'
os.environ['KAGGLE_KEY'] = kaggle_key

In [2]:
import kaggle

In [3]:
import os
os.getcwd()

'c:\\Users\\gilld\\OneDrive\\Documents\\Projects\\Sports-Data-Analysis\\src'

In [4]:
#Downloading the full dataset and unzipping it to data folder
# !kaggle datasets download -d ahmadrazakashif/global-football-goalscorers-dataset --unzip -p ./data

In [5]:
#Donwloading only result file
# !kaggle datasets download -d ahmadrazakashif/global-football-goalscorers-dataset -f results.csv

In [6]:
import pandas as pd

Results data

In [7]:
df = pd.read_csv('results.csv', na_values =['NA', 'NaN', ''])

In [8]:
df.head()

,date,home_team,away_team,home_score,away_score,tournament,city,country,neutral
0,1872-11-30,Scotland,England,0,0,Friendly,Glasgow,Scotland,False
1,1873-03-08,England,Scotland,4,2,Friendly,London,England,False
2,1874-03-07,Scotland,England,2,1,Friendly,Glasgow,Scotland,False
3,1875-03-06,England,Scotland,2,2,Friendly,London,England,False
4,1876-03-04,Scotland,England,3,0,Friendly,Glasgow,Scotland,False

In [9]:
import sys
print(sys.executable)

c:\Users\gilld\anaconda3\envs\datascience\python.exe

In [10]:
df.head(20)

,date,home_team,away_team,home_score,away_score,tournament,city,country,neutral
0,1872-11-30,Scotland,England,0,0,Friendly,Glasgow,Scotland,False
1,1873-03-08,England,Scotland,4,2,Friendly,London,England,False
2,1874-03-07,Scotland,England,2,1,Friendly,Glasgow,Scotland,False
3,1875-03-06,England,Scotland,2,2,Friendly,London,England,False
4,1876-03-04,Scotland,England,3,0,Friendly,Glasgow,Scotland,False
5,1876-03-25,Scotland,Wales,4,0,Friendly,Glasgow,Scotland,False
6,1877-03-03,England,Scotland,1,3,Friendly,London,England,False
7,1877-03-05,Wales,Scotland,0,2,Friendly,Wrexham,Wales,False
8,1878-03-02,Scotland,England,7,2,Friendly,Glasgow,Scotland,False
9,1878-03-23,Scotland,Wales,9,0,Friendly,Glasgow,Scotland,False
10,1879-01-18,England,Wales,2,1,Friendly,London,England,False
11,1879-04-05,England,Scotland,5,4,Friendly,London,England,False
12,1879-04-07,Wales,Scotland,0,3,Friendly,Wrexham,Wales,False
13,1880-03-13,Scotland,England,5,4,Friendly,Glasgow,Scotland,False
14,1880-03-15,Wales,England,2,3,Friendly,Wrexham,Wales,False
15,1880-03-27,Scotland,Wales,5,1,Friendly,Glasgow,Scotland,False
16,1881-02-26,England,Wales,0,1,Friendly,Blackburn,England,False
17,1881-03-12,England,Scotland,1,6,Friendly,London,England,False
18,1881-03-14,Wales,Scotland,1,5,Friendly,Wrexham,Wales,False
19,1882-02-18,Northern Ireland,England,0,13,Friendly,Belfast,Ireland,False

In [11]:
df['tournament'].unique()

array(['Friendly', 'British Home Championship', 'Évence Coppée Trophy',
       'Muratti Vase', 'Copa Lipton', 'Copa Newton',
       'Copa Premio Honor Argentino', 'Olympic Games',
       'Copa Premio Honor Uruguayo', 'Far Eastern Championship Games',
       'Copa Roca', 'Copa América', 'Inter-Allied Games', 'Peace Cup',
       'Open International Championship', 'Soccer Ashes',
       'Copa Chevallier Boutell', 'Nordic Championship',
       'Central European International Cup', 'Baltic Cup', 'Balkan Cup',
       'Central American and Caribbean Games', 'FIFA World Cup',
       'Copa Rio Branco', 'FIFA World Cup qualification',
       'Bolivarian Games', 'CCCF Championship', 'NAFC Championship',
       'Copa Oswaldo Cruz', 'Asian Games', 'Pan American Championship',
       'Copa del Pacífico', "Copa Bernardo O'Higgins",
       'AFC Asian Cup qualification', 'Atlantic Cup', 'AFC Asian Cup',
       'African Cup of Nations', 'Copa Paz del Chaco',
       'Merdeka Tournament', 'UEFA Euro qualification',
       'Southeast Asian Peninsular Games', 'African Friendship Games',
       'UEFA Euro', 'Windward Islands Tournament',
       'African Cup of Nations qualification', 'Vietnam Independence Cup',
       'Copa Carlos Dittborn', 'Phillip Seaga Cup',
       'CONCACAF Championship', 'Copa Juan Pinto Durán', 'Arab Cup',
       'South Pacific Games', 'Zambian Independence Tournament',
       'CONCACAF Championship qualification', 'Copa Artigas',
       'All-African Games', 'GaNEFo', 'Copa América qualification',
       "King's Cup", 'Gulf Cup', 'Indonesia Tournament', 'Korea Cup',
       'Palestine Cup', 'Brazil Independence Cup', 'Copa Ramón Castilla',
       'Oceania Nations Cup', 'CECAFA Cup', 'Kuneitra Cup',
       'Copa Félix Bogado', 'Real Madrid 75th Anniversary Cup',
       'Beijing International Friendship Tournament',
       'Southeast Asian Games', 'Kirin Cup',
       'CFU Caribbean Cup qualification', 'CFU Caribbean Cup',
       'Amílcar Cabral Cup', 'FIFA 75th Anniversary Cup',
       'Indian Ocean Island Games',
       'Guangzhou International Friendship Tournament', 'Mundialito',
       'South Pacific Mini Games', 'West African Cup', 'Nehru Cup',
       'Merlion Cup', 'Trans-Tasman Cup', 'Great Wall Cup',
       'South Asian Games', 'UDEAC Cup', 'Rous Cup',
       'CONMEBOL–UEFA Cup of Champions', 'Miami Cup',
       'Lunar New Year Cup', 'Arab Cup qualification',
       'Tournoi de France', 'Malta International Tournament',
       'Four Nations Tournament', 'Matthews Cup',
       'Tournament Burkina Faso', 'Marlboro Cup', 'Island Games',
       'NAFU Championship', 'Dynasty Cup', 'Dakar Tournament',
       'UNCAF Cup', 'Scania 100 Tournament', 'Gold Cup', 'USA Cup',
       'Jordan International Tournament', 'Confederations Cup',
       'East Asian Games', 'United Arab Emirates Friendship Tournament',
       'Joe Robbie Cup', 'Oceania Nations Cup qualification',
       'Simba Tournament', 'SAFF Cup', 'AFF Championship',
       'King Hassan II Tournament', 'Cyprus International Tournament',
       'Dunhill Cup', 'COSAFA Cup qualification', 'COSAFA Cup',
       'Gold Cup qualification', 'AFF Championship qualification',
       'SKN Football Festival', "Four Nations' Cup", 'UNIFFAC Cup',
       'WAFF Championship', 'Millennium Cup',
       'Cup of Ancient Civilizations', "Prime Minister's Cup",
       'Unity Cup', 'The Other Final', 'EAFF Championship',
       'TIFOCO Tournament', 'Afro-Asian Games', 'AFC Challenge Cup',
       'FIFI Wild Cup', 'ELF Cup', 'Viva World Cup',
       'AFC Challenge Cup qualification', "Coupe de l'Outre-Mer",
       'VFF Cup', 'Corsica Cup', 'Dragon Cup', 'ABCS Tournament',
       'Nile Basin Tournament', 'Nations Cup', 'Copa Confraternidad',
       'Pacific Games', 'Superclásico de las Américas',
       'Kirin Challenge Cup', 'Tynwald Hill Tournament', 'OSN Cup',
       'CONIFA World Football Cup', 'Niamh Challenge Cup',
       'CONIFA European Football Cup', 'Benedikt Fontana Cup',
       'ConIFA Challenger Cup', 'Hungary Heritage Cup', 'World Unity Cup',
       'Pacific Mini Games', 'Intercontinental Cup',
       'UEFA Nations League', 'CONCACAF Nations League qualification',
       'Atlantic Heritage Cup', 'Inter Games', 'CONCACAF Nations League',
       'Three Nations Cup', 'Mahinda Rajapaksa Cup', 'Navruz Cup',
       'CONIFA Africa Football Cup', 'CONIFA South America Football Cup',
       "MSG Prime Minister's Cup", 'Tri Nation Tournament',
       'CAFA Nations Cup', 'Mauritius Four Nations Cup',
       'CONIFA World Football Cup qualification', 'CONIFA Asia Cup',
       'FIFA Series', 'Marianas Cup', 'Tri-Nations Series',
       'ASEAN Championship qualification', 'ASEAN Championship',
       'EAFF Championship qualification', 'Mapinduzi Cup',
       'Canadian Shield', 'Outrigger Challenge Cup',
       'South Asian Super Cup'], dtype=object)

In [12]:
pd.isnull(df).sum()

date          0
home_team     0
away_team     0
home_score    0
away_score    0
tournament    0
city          0
country       0
neutral       0
dtype: int64

In [13]:
df.head()

,date,home_team,away_team,home_score,away_score,tournament,city,country,neutral
0,1872-11-30,Scotland,England,0,0,Friendly,Glasgow,Scotland,False
1,1873-03-08,England,Scotland,4,2,Friendly,London,England,False
2,1874-03-07,Scotland,England,2,1,Friendly,Glasgow,Scotland,False
3,1875-03-06,England,Scotland,2,2,Friendly,London,England,False
4,1876-03-04,Scotland,England,3,0,Friendly,Glasgow,Scotland,False

In [14]:
# df.rename(columns={'home_team':'team'}, inplace=True)

#inplace=True means the changes are made in the original dataframe itself

In [15]:
df.head()

,date,home_team,away_team,home_score,away_score,tournament,city,country,neutral
0,1872-11-30,Scotland,England,0,0,Friendly,Glasgow,Scotland,False
1,1873-03-08,England,Scotland,4,2,Friendly,London,England,False
2,1874-03-07,Scotland,England,2,1,Friendly,Glasgow,Scotland,False
3,1875-03-06,England,Scotland,2,2,Friendly,London,England,False
4,1876-03-04,Scotland,England,3,0,Friendly,Glasgow,Scotland,False

In [16]:
df.columns = df.columns.str.lower()

In [17]:
df.columns = df.columns.str.replace(' ', '_')

In [18]:
df.columns

Index(['date', 'home_team', 'away_team', 'home_score', 'away_score',
       'tournament', 'city', 'country', 'neutral'],
      dtype='object')

In [19]:
df['team_win'] = df['home_score'] > df['away_score']
# New column 'team_win' added to indicate if the home team won

In [20]:
df.columns

Index(['date', 'home_team', 'away_team', 'home_score', 'away_score',
       'tournament', 'city', 'country', 'neutral', 'team_win'],
      dtype='object')

In [21]:
df.head()

,date,home_team,away_team,home_score,away_score,tournament,city,country,neutral,team_win
0,1872-11-30,Scotland,England,0,0,Friendly,Glasgow,Scotland,False,False
1,1873-03-08,England,Scotland,4,2,Friendly,London,England,False,True
2,1874-03-07,Scotland,England,2,1,Friendly,Glasgow,Scotland,False,True
3,1875-03-06,England,Scotland,2,2,Friendly,London,England,False,False
4,1876-03-04,Scotland,England,3,0,Friendly,Glasgow,Scotland,False,True

In [22]:
df.dtypes

date          object
home_team     object
away_team     object
home_score     int64
away_score     int64
tournament    object
city          object
country       object
neutral         bool
team_win        bool
dtype: object

In [23]:
#convert date to date dtype
df['date'] = pd.to_datetime(df['date'], format="%Y-%m-%d")

In [24]:
df.dtypes

date          datetime64[ns]
home_team             object
away_team             object
home_score             int64
away_score             int64
tournament            object
city                  object
country               object
neutral                 bool
team_win                bool
dtype: object

In [25]:
#drop unwantsed columns
df.drop(columns=['neutral'], inplace=True)
#inplace=True means the changes are made in the original dataframe itself

In [26]:
import sqlalchemy as sqal

In [27]:
import sys
print(sys.executable)

c:\Users\gilld\anaconda3\envs\datascience\python.exe

In [28]:

# import mysql.connector

In [29]:
from password import password_sql_server, encoded_password

In [30]:
# print(type(password_sql_server))

In [31]:
# try:
#     mydb = mysql.connector.connect(
#         host="127.0.0.1",
#         user="root",
#         passwd=password_sql_server,      
#         port=3307  
#     )
# except mysql.connector.Error as err:
#     print(f"Error: {err}")

In [32]:
# import mysql.connector

# cnx = mysql.connector.connect(user='root', password=password_sql_server,
#                               host='127.0.0.1',
#                               database='data', 
#                               port=3307)
# cnx.close()

In [33]:
# mydb = mysql.connector.connect(host="localhost", user="root", passwd=password_sql_server, port=3307, database="data")

In [34]:
# mycursor = mydb.cursor()

In [35]:
# mycursor.execute("select * from match_data")
# for i in mycursor:
#     print(i)

In [36]:
import sqlalchemy as sqal
engine = sqal.create_engine(f'mysql+mysqlconnector://root:{encoded_password}@127.0.0.1:3307/data')
conn = engine.connect()

In [37]:
# df.to_sql('match_data', con=conn, if_exists='replace', index=False, method='multi')

# index false means that the index column of the dataframe will not be written to the SQL table

In [38]:
# method multi is used to insert multiple records in a single query for better performance, 
# for example, inserting 1000 records at a time instead of one by one
# such as INSERT INTO match_data (col1, col2) VALUES (val1a, val2a), (val1b, val2b), ... ;
# instead of INSERT INTO match_data (col1, col2) VALUES (val1a, val2a);

In [70]:
df.shape

(48673, 9)

Former Names Analysis

In [39]:
former_names = pd.read_csv('data/former_names.csv')

In [40]:
former_names.head()

          current                former  start_date    end_date
0           Benin               Dahomey  1959-11-08  1975-11-30
1    Burkina Faso           Upper Volta  1960-04-14  1984-08-04
2         Curaçao  Netherlands Antilles  1957-03-03  2010-10-10
3  Czechoslovakia               Bohemia  1903-04-05  1919-01-01
4  Czechoslovakia   Bohemia and Moravia  1939-01-01  1945-05-01

In [41]:
former_names['start_date'] = pd.to_datetime(former_names['start_date'], format="%Y-%m-%d")
former_names['end_date'] = pd.to_datetime(former_names['end_date'], format="%Y-%m-%d")

In [42]:
former_names.head()

          current                former start_date   end_date
0           Benin               Dahomey 1959-11-08 1975-11-30
1    Burkina Faso           Upper Volta 1960-04-14 1984-08-04
2         Curaçao  Netherlands Antilles 1957-03-03 2010-10-10
3  Czechoslovakia               Bohemia 1903-04-05 1919-01-01
4  Czechoslovakia   Bohemia and Moravia 1939-01-01 1945-05-01

In [43]:
former_names.isnull().sum()

current       0
former        0
start_date    0
end_date      0
dtype: int64

In [44]:
former_names.rename(columns={'current':'current_name'}, inplace=True)

In [45]:
# former_names.to_sql('former_names', con=conn, if_exists='replace', index=False, method="multi")

In [46]:
former_names.shape

(34, 4)

In [ ]:
output = former_names[former_names['former'] == 'Malaya']
# gets the result where that specific former name is matched in the entire former_names dataframe
output
output['current_name']

19    Malaysia
Name: current_name, dtype: object

Goalscorers Analysis

In [47]:
goalscorers = pd.read_csv('data/goalscorers.csv')

In [48]:
goalscorers.head()

,date,home_team,away_team,team,scorer,minute,own_goal,penalty
0,1916-07-02,Chile,Uruguay,Uruguay,José Piendibene,44.0,False,False
1,1916-07-02,Chile,Uruguay,Uruguay,Isabelino Gradín,55.0,False,False
2,1916-07-02,Chile,Uruguay,Uruguay,Isabelino Gradín,70.0,False,False
3,1916-07-02,Chile,Uruguay,Uruguay,José Piendibene,75.0,False,False
4,1916-07-06,Argentina,Chile,Argentina,Alberto Ohaco,2.0,False,False

In [49]:
goalscorers.dtypes

date          object
home_team     object
away_team     object
team          object
scorer        object
minute       float64
own_goal        bool
penalty         bool
dtype: object

In [50]:
goalscorers['date'] = pd.to_datetime(goalscorers['date'], format="%Y-%m-%d")

In [51]:
goalscorers.dtypes

date         datetime64[ns]
home_team            object
away_team            object
team                 object
scorer               object
minute              float64
own_goal               bool
penalty                bool
dtype: object

In [52]:
goalscorers.isnull().sum()

date           0
home_team      0
away_team      0
team           0
scorer        48
minute       256
own_goal       0
penalty        0
dtype: int64

In [53]:
goalscorers.dropna(inplace=True)
# drop rows that contain null values
# if you want to drop columns use axis=1 parameter : df.dropna(axis=1, inplace=True)

In [54]:
goalscorers.isnull().sum()

date         0
home_team    0
away_team    0
team         0
scorer       0
minute       0
own_goal     0
penalty      0
dtype: int64

In [55]:
goalscorers.shape

(44191, 8)

In [56]:
# goalscorers.to_sql('goalscorers', con=conn, if_exists='replace', index=False, method="multi")

Shootouts Analysis

In [57]:
shootouts = pd.read_csv('data/shootouts.csv')

In [58]:
shootouts.head()

         date    home_team         away_team       winner first_shooter
0  1967-08-22        India            Taiwan       Taiwan           NaN
1  1971-11-14  South Korea  Vietnam Republic  South Korea           NaN
2  1972-05-07  South Korea              Iraq         Iraq           NaN
3  1972-05-17     Thailand       South Korea  South Korea           NaN
4  1972-05-19     Thailand          Cambodia     Thailand           NaN

In [59]:
shootouts.isnull().sum()

date               0
home_team          0
away_team          0
winner             0
first_shooter    417
dtype: int64

In [60]:
shootouts['first_shooter'].isnull().sum()

np.int64(417)

In [61]:
# Most of the first_shooter values are missing, dropping this column is not a good idea
# Will fill missing values randomly between the home_team and away_team
import numpy as np

def fill_random(row):
    if pd.isnull(row['first_shooter']):
        return np.random.choice([row['home_team'], row['away_team']])
    else:
        return row['first_shooter']

shootouts['first_shooter'] = shootouts.apply(fill_random, axis=1)
# Axis 1 means we are applying the function to each row

In [62]:
shootouts['first_shooter'].isnull().sum()

np.int64(0)

In [63]:
shootouts['date'] = pd.to_datetime(shootouts['date'], format="%Y-%m-%d")

In [64]:
shootouts.shape

(653, 5)

In [65]:
shootouts.isnull().sum()

date             0
home_team        0
away_team        0
winner           0
first_shooter    0
dtype: int64

In [66]:
shootouts.dtypes

date             datetime64[ns]
home_team                object
away_team                object
winner                   object
first_shooter            object
dtype: object

In [68]:
shootouts.shape

(653, 5)

In [ ]:
shootouts['first_shooter_won'] = (shootouts['first_shooter'] == shootouts['winner'])
win_counts = shootouts['first_shooter_won'].value_counts().reset_index()
win_counts.columns = ['lost/won', 'count']
win_counts
# what percentage of teams won by being the first shooters

   lost/won  count
0     False    329
1      True    324

In [69]:
# shootouts.to_sql("shootouts", con=conn, if_exists="replace", index=False, method="multi")